Benchmarks/media-streaming/parser_output/output_run_2/result2.log

Total: connections 440 requests 7453 replies 7453 test-duration 330.119 s
Number of connected connections is currently = 0

Connection rate: 1.3 conn/s (750.3 ms/conn, <=440 concurrent connections)
Connected connection rate: 1.3 conn/s (750.3 ms/conn, <=440 concurrent connected connections)
Connection time [ms]: min 30010.8 avg 129492.0 max 320657.9 median 99999.5 stddev 101304.1
Connection time [ms]: connect 0.1
Connection length [replies/conn]: 16.939

Response time (no timeouts) [ms]: 0.0
Response time (only timeouts) [ms]: 0.0
Response time (all) [ms]: 129492.0
Request rate: 22.6 req/s (44.3 ms/req)
Request size [B]: 139.0

Overall reply rate: 22.6 replies/sec
Reply rate [replies/s]: min 8.6 avg 22.6 max 176.4 stddev 29.9 (66 samples)
Reply time [ms]: response 1.5 transfer 4.1
Reply size [B]: header 294.0 content 3022851.0 footer 0.0 (total 3023145.0)
Reply status: 1xx=0 2xx=7453 3xx=0 4xx=0 5xx=0

CPU time [s]: user 1.89 system 26.35 (user 0.6% system 8.0% total 8.6%)
Net I/O: 66656.0 KB/s (546.0*10^6 bps)

Errors: total 0 client-timo 0 socket-timo 0 connrefused 0 connreset 0
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 addrinuse 0 other 0
Unconnected timeouts 0 connected timeouts 0 total (0) client_timeouts 0


Session rate [sess/s]: min 0.00 avg 1.33 max 9.00 stddev 3.16 (440/440)
Session: avg 1.00 connections/session
Session lifetime [s]: 129.5
Session failtime [s]: 0.0
Session length histogram: 0 0 0 0 0 0 0 90 0 0 86 0 0 0 0 89 0 88 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 87